# Pandas II - Data Cleaning

_September 17, 2020_

Agenda today:
- Introduction to lambda function
- Introduction to data cleaning in pandas
- Combining DataFrames
- Optional Exercises

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

## Part I. Lambda function
lambda functions are known as anonymous functions in Python. It allows you to write one-line functions that are used together with `map()`, `filter()`.

Syntax of lambda function: `lambda arguments:expressions`.

In [2]:
# lambda function with one argument
func_1 = lambda x:x+10
func_1(10)

20

In [3]:
(lambda x:x+10)(10)

20

In [4]:
#passing multiple with commas
(lambda x,y,z: x+y+z)(100,20,3)

123

In [5]:
#lambda with conditional statement
(lambda x: x+10 if x>10 else x+20)(5)

25

In [6]:
# lambda function with multiple arguments
func_2 = lambda x, y, z: x+y+z if z + y > x else x-y+z
func_2(10,12,10)

32

map(function, collection) is like a for loop where function is applied through a collection/iterable

filter(function, collection) is like a map functions but filters through a boolean functions through a collection/iterable

In [7]:
# exercise: turn the below function into a lambda function
def count_zeros(li):
    """
    return a count of how many zeros are in a list
    """
    count = sum(x == 0 for x in li)
    return count

In [8]:
count_zeros([1,2,4,0])

1

In [9]:
# your answer here
sum(list(map(lambda x:x == 0,[1,2,4,0])))

1

In [10]:
sum(map(lambda x: x == 0, [0,0,0,4,5,6,7]))
#would this be faster, because you don't have to map the list aka less
#memory usage?

3

In [11]:
map(lambda x: x == 0, [0,0,0,4,5,6,7])

In [13]:
list(map(lambda x: x == 0, [0,0,0,4,5,6,7]))

[True, True, True, False, False, False, False]

## Part II. Data Cleaning in Pandas
You might wonder what the usage of lambda functions are - they are incredibly useful when applied to data cleaning in Pandas. You can apply it to columns or the entire dataframe to get results you need. For example, you might want to convert a column with $USD to Euros, or temperature expressed in Celsius to Fehrenheit. You will learn three new functions:

- `Apply()` - on both series and dataframe

- `Applymap()` - only on dataframes

- `Map()` - only on series

In [15]:
# import the dataframe 
df = pd.read_csv('auto-mpg.csv')

In [16]:
# examine the first few rows of it 
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [19]:
# check the datatypes of the df
df.dtypes

mpg             float64
cylinders         int64
displacement    float64
horsepower       object
weight            int64
acceleration    float64
model year        int64
origin            int64
car name         object
dtype: object

In [22]:
# check whether you have missing values
df.isnull().sum()

mpg             0
cylinders       0
displacement    0
horsepower      0
weight          0
acceleration    0
model year      0
origin          0
car name        0
dtype: int64

In [ ]:
# creating new columns - broadcasting

In [ ]:
# check the dataframe

In [23]:
# time to use lambda and apply! with apply, applymap, and map, you never need to "iterate through the rows"

# create a function that takes in the weight as lbs, and return weight in tons 

# 1 lb = 0.0005
df["weight_in_tons"] = df.weight.apply(lambda w: w *0.0005)

In [25]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,weight_in_tons
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,1.7520
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320,1.8465
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite,1.7180
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst,1.7165
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino,1.7245

In [26]:
df["weight_in_tons2"] = df.weight * 0.0005 #this is faster! broadcasting!!!
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,weight_in_tons,weight_in_tons2
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,1.7520,1.7520
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320,1.8465,1.8465
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite,1.7180,1.7180
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst,1.7165,1.7165
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino,1.7245,1.7245

In [27]:
df.describe()

,mpg,cylinders,displacement,weight,acceleration,model year,origin,weight_in_tons,weight_in_tons2
count,398.000000,398.000000,398.000000,398.000000,398.000000,398.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,2970.424623,15.568090,76.010050,1.572864,1.485212,1.485212
std,7.815984,1.701004,104.269838,846.841774,2.757689,3.697627,0.802055,0.423421,0.423421
min,9.000000,3.000000,68.000000,1613.000000,8.000000,70.000000,1.000000,0.806500,0.806500
25%,17.500000,4.000000,104.250000,2223.750000,13.825000,73.000000,1.000000,1.111875,1.111875
50%,23.000000,4.000000,148.500000,2803.500000,15.500000,76.000000,1.000000,1.401750,1.401750
75%,29.000000,8.000000,262.000000,3608.000000,17.175000,79.000000,2.000000,1.804000,1.804000
max,46.600000,8.000000,455.000000,5140.000000,24.800000,82.000000,3.000000,2.570000,2.570000

In [29]:
# exercise - create a new column called "years old", which determines how old a car is 
df["years_old"] = 120 - df["model year"]
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,weight_in_tons,weight_in_tons2,years_old
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,1.7520,1.7520,50
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320,1.8465,1.8465,50
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite,1.7180,1.7180,50
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst,1.7165,1.7165,50
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino,1.7245,1.7245,50

In [31]:
df["years_old2"] = df["model year"].apply(lambda x: 120-x)
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,weight_in_tons,weight_in_tons2,years_old,years_old2
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,1.7520,1.7520,50,50
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320,1.8465,1.8465,50,50
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite,1.7180,1.7180,50,50
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst,1.7165,1.7165,50,50
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino,1.7245,1.7245,50,50

## Part III. Combining DataFrames in Pandas
There are two methods in Pandas that allow us to combine our DataFrames:

    - df.merge() - allow us to match dataframes on either indices or columns
    - df.concat() - allow us to concatenate two dataframes vertically or horizontally

In [3]:
# create some toy dataframes 
import pandas as pd
import numpy as np
small_grades = pd.DataFrame({"students":["Amelia","Justin W","Brendan"],
                          "projects":[1,2,1],
                          "grades":np.random.randint(80,100,3)})
small_quiz = pd.DataFrame({"students":["Billy","Cierra","Justin W"],
                            "quiz_score":np.random.randint(0,10,3)})

In [4]:
### df.concat 
combined = pd.concat([small_grades, small_quiz], axis = 1)

<img src = 'sql-joins.png' width = 400>

Based on the diagram above, what are the differences of different types of merge?

In [5]:
combined.head()

   students  projects  grades  students  quiz_score
0    Amelia         1      83     Billy           4
1  Justin W         2      81    Cierra           4
2   Brendan         1      95  Justin W           0

In [52]:
### df.merge
#combined2 = small_grades.merge(small_quiz, how = "inner")
combined2 = small_grades.merge(small_grades, on = "students")
# inner merge
combined2.head()

   students  projects_x  grades_x  projects_y  grades_y
0    Amelia           1        83           1        83
1  Justin W           2        81           2        81
2   Brendan           1        95           1        95

In [10]:
# outer merge
combined3 = small_grades.merge(small_quiz, how = "outer")
combined3.head()

   students  projects  grades  quiz_score
0    Amelia       1.0    83.0         NaN
1  Justin W       2.0    81.0         0.0
2   Brendan       1.0    95.0         NaN
3     Billy       NaN     NaN         4.0
4    Cierra       NaN     NaN         4.0

In [12]:
# right merge
combined4 = small_grades.merge(small_quiz, how = "right")
combined4.head()

   students  projects  grades  quiz_score
0  Justin W       2.0    81.0           0
1     Billy       NaN     NaN           4
2    Cierra       NaN     NaN           4

### Data Cleaning - level up with the adult dataset

Dataset documentation:
- age: continuous.
- workclass: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.
- fnlwgt: continuous.
- education: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.
- education-num: continuous.
- marital-status: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.
- occupation: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.
- relationship: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.
- race: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.
- sex: Female, Male.
- capital-gain: continuous.
- capital-loss: continuous.
- hours-per-week: continuous.
- native-country: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.

In [13]:
url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data'
adults = pd.read_csv(url,header = None)

In [14]:
# Check the first few rows 
adults.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [15]:
# add the columns to dataset
columns = ['age', 'workclass', 'fnlwgt', 'education', 'education-num', 'marital_status','occupation', 'relationship', 'race', 'sex', 'capital_gain', 'capital_loss', 'hours_per_week', 'native_country','income']
adults.columns = columns
adults.head()

,age,workclass,fnlwgt,education,education-num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [25]:
# check the info of dataset
adults.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
age               32561 non-null int64
workclass         32561 non-null object
fnlwgt            32561 non-null int64
education         32561 non-null object
education-num     32561 non-null int64
marital_status    32561 non-null object
occupation        32561 non-null object
relationship      32561 non-null object
race              32561 non-null object
sex               32561 non-null object
capital_gain      32561 non-null int64
capital_loss      32561 non-null int64
hours_per_week    32561 non-null int64
native_country    32561 non-null object
income            32561 non-null object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [18]:
# check missing values
adults.isna().sum()

age               0
workclass         0
fnlwgt            0
education         0
education-num     0
marital_status    0
occupation        0
relationship      0
race              0
sex               0
capital_gain      0
capital_loss      0
hours_per_week    0
native_country    0
income            0
dtype: int64

In [20]:
adults.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
education-num     0
marital_status    0
occupation        0
relationship      0
race              0
sex               0
capital_gain      0
capital_loss      0
hours_per_week    0
native_country    0
income            0
dtype: int64

In [26]:
# perform some queries - find the total num female & bachelors
not_that_single_ladies = adults[(adults["sex"] == "Female") & (adults["education"] == "Bachelors")]
not_that_single_ladies.head()

Empty DataFrame
Columns: [age, workclass, fnlwgt, education, education-num, marital_status, occupation, relationship, race, sex, capital_gain, capital_loss, hours_per_week, native_country, income]
Index: []

In [ ]:
# seems like we have data anolmaly, find out what that is and fix it 
# hint - tons of entries contain white space, remove it!

In [33]:
adults["sex"] = adults["sex"].apply(lambda txt: txt.strip())
adults["sex"][5]

'Female'

In [39]:
adults["education"] = adults["education"].apply(lambda txt: txt.strip())
adults["education"][0]

'Bachelors'

In [55]:
not_that_single_ladies = adults[(adults["sex"] == "Female") & (adults["education"] == "Bachelors")]
#not_that_single_ladies.head()
not_that_single_ladies.age.count()

1619

In [42]:
list(adults["income"][:5]) #checking for whitespace!!

[' <=50K', ' <=50K', ' <=50K', ' <=50K', ' <=50K']

In [ ]:
# subsetting multiple cols

In [46]:
# create a column called income_binary, 1 if >50k and 0 otherwise
adults["income"] = adults["income"].apply(lambda txt: txt.strip())
adults["income_binary"] = adults["income"].apply(lambda txt: 1 if txt == ">50K" else 0)
adults.head(10)

,age,workclass,fnlwgt,education,education-num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income,income_binary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K,0
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K,0
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K,0
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K,0
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K,0
5,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K,0
6,49,Private,160187,9th,5,Married-spouse-absent,Other-service,Not-in-family,Black,Female,0,0,16,Jamaica,<=50K,0
7,52,Self-emp-not-inc,209642,HS-grad,9,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,45,United-States,>50K,1
8,31,Private,45781,Masters,14,Never-married,Prof-specialty,Not-in-family,White,Female,14084,0,50,United-States,>50K,1
9,42,Private,159449,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,5178,0,40,United-States,>50K,1

In [72]:
adults["income_binary2"] = adults["income"]
adults.head()

,age,workclass,fnlwgt,education,education-num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income,income_binary,income_binary2
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K,0,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K,0,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K,0,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K,0,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K,0,<=50K

In [96]:
income_bin2 = adults.income
income_bin2

0        <=50K
1        <=50K
2        <=50K
3        <=50K
4        <=50K
         ...
32556    <=50K
32557     >50K
32558    <=50K
32559    <=50K
32560     >50K
Name: income, Length: 32561, dtype: object

In [94]:
income_bin2 = income_bin2.where(income_bin2 == "<50K", 0)

In [95]:
income_bin2.value_counts()

0    32561
Name: income, dtype: int64

In [81]:
adults.income_binary2 = income_bin2.where(adults.income_binary2 == "<50K", "0")

In [82]:
adults.income_binary2.value_counts()

0    32561
Name: income_binary2, dtype: int64

In [83]:
adults.income.value_counts()

<=50K    24720
>50K      7841
Name: income, dtype: int64

In [50]:
# get some descriptive statistics of the income distribution 
adults.loc["income":"income_binary",:].describe()

,age,fnlwgt,education-num,capital_gain,capital_loss,hours_per_week,income_binary
count,0.0,0.0,0.0,0.0,0.0,0.0,0.0
mean,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,NaN,NaN